app/controllers/admin/admins_controller.rb

  def index
    @admins = Admin.all
---
SELECT `admins`.* FROM `admins`

  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save
---
INSERT INTO `admins` (`email`, `encrypted_password`, `first_name`, `last_name`, `city`, `address`, `created_at`, `updated_at`, `role`, `identification_card`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`, `birthdate`) VALUES ('sammy@sammy.com', '$2a$11$hRfaOJdWpQWH8/NrK8eDWOjrsWdKyVdReVVTLSfhw4tYvGDHbWGDe', 'Sammy', 'Rosas', 'Bogotá', 'Cra. 91 # 70b 18 B/ Maratú', '2020-05-22 19:55:59', '2020-05-22 19:55:59', 'Administrador', '1110485759', 'paols.jpg', 'image/jpeg', 268738, '2020-05-22 19:55:59', '2016-03-20')

  def update
    respond_to do |format|
      if @admin.update(admin_params)
---
UPDATE `admins` SET `first_name` = 'Samtom', `encrypted_password` = '$2a$11$Lg5o7dah4cgv5wsdlFL2sOWyUq1PnK0b3CDV/I0azVAPaKvMZWgHy', `role` = '', `birthdate` = '2004-02-22', `updated_at` = '2020-05-22 21:54:02' WHERE `admins`.`id` = 3

    def set_admin
      @admin = Admin.find(params[:id])
---
SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 3 LIMIT 1