app/controllers/admin/itineraries_controller.rb

  def index
    @itineraries = Itinerary.all
---
SELECT `itineraries`.* FROM `itineraries`

  def create
    @itinerary = Itinerary.new(itinerary_params)

    respond_to do |format|
      if @itinerary.save
---
INSERT INTO `itineraries` (`title`, `place`, `value`, `discount`, `discount_date`, `description`, `created_at`, `updated_at`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`) VALUES ('Prueba', 'Bogotá', 50.0, 0.0, '2020-05-22', 'sdsdsd', '2020-05-22 23:07:11', '2020-05-22 23:07:11', 'Firma_Paola.jpeg', 'image/jpeg', 40919, '2020-05-22 23:07:11')

  def update
    respond_to do |format|
      if @itinerary.update(itinerary_params)
---
UPDATE `itineraries` SET `value` = 150000.0, `short_description` = 'Saltarás completamente asegurado al instructor a 10.000 pies de altura desde una aeronave en perfecto estado, observando lugares como Girardot, Tolemaida, Flandes, Tocaima, San Marcos, Rio Magdalena, Rio Bogotá, cordilleras y a veces podrás ver los nevados del Tolima y del Ruiz, para después lanzarte con tu instructor mientras te van tomando un vídeo de toda la experiencia de vuelo.', `updated_at` = '2020-05-23 00:45:03' WHERE `itineraries`.`id` = 1

    def set_itinerary
      @itinerary = Itinerary.find(params[:id])
---
SELECT  `itineraries`.* FROM `itineraries` WHERE `itineraries`.`id` = 1 LIMIT 1