app/views/home/_itinerario.html.erb

SELECT `itineraries`.* FROM `itineraries`
---
<div class="row mt-5" id="itinerary">
  <% Itinerary.all.each do |i| %>