app/views/admin/itineraries/index.html.erb

SELECT `itineraries`.* FROM `itineraries`
---
        <th><%= t('activerecord.attributes.itinerary.title') %></th>
        <th><%= t('activerecord.attributes.itinerary.value') %></th>