app/views/admin/admins/_form.html.erb

<div id="error_explanation">
  <h2><%= pluralize(admin.errors.count, "error") %> <%= t('activerecord.attributes.errors.models.admin.save_error') %>
---
SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 1 ORDER BY `admins`.`id` ASC LIMIT 1