app/views/admin/admins/index.html.erb

      <tr>
        <th><%= t('activerecord.attributes.admin.first_name') %></th>
---
SELECT `admins`.* FROM `admins`