app/views/admin/admins/show.html.erb

        <div class="col">
          <strong><%= t('activerecord.attributes.admin.first_name') %>:</strong>
---
SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 1 ORDER BY `admins`.`id` ASC LIMIT 1